# Day4

In [12]:
import pandas as pd
import numpy as np

obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

#### 앞 내용으로 채움(f fill)

In [9]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

#### 뒤 내용으로 채움(b fill)

In [10]:
obj3.reindex(range(6),method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

#### 위 기능은 타임시리즈(시계열 데이터에서)에서 누락된 시간부분의 내용을 채워넣을때 같은 경우 사용

#### 열 재배열

In [15]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'], columns=['Daegu', 'Busan', 'Jaeju'])
frame

   Daegu  Busan  Jaeju
a      0      1      2
c      3      4      5
d      6      7      8

In [17]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Daegu  Busan  Jaeju
a    0.0    1.0    2.0
b    NaN    NaN    NaN
c    3.0    4.0    5.0
d    6.0    7.0    8.0

In [20]:
city = ['Busan', 'Daejeon', 'Jaeju']
frame.reindex(columns=city)

   Busan  Daejeon  Jaeju
a      1      NaN      2
c      4      NaN      5
d      7      NaN      8

In [27]:
#frame.reindex(['a','b','c','d'], method='ffill', columns=city)
rs = frame.reindex(['a','b','c','d'], method='ffill').reindex(columns=city)
rs

   Busan  Daejeon  Jaeju
a      1      NaN      2
b      1      NaN      2
c      4      NaN      5
d      7      NaN      8

In [29]:
rs.ix[['a','b','c','d'], city]

c:\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   Busan  Daejeon  Jaeju
a      1      NaN      2
b      1      NaN      2
c      4      NaN      5
d      7      NaN      8

In [34]:
data = pd.DataFrame(np.arange(16).reshape((4,4)) )

In [62]:
data2 = pd.DataFrame(np.arange(16).reshape((4,4)) , index=['Daegu', 'Sejong', 'Daejeon', 'Incheon'], columns=['one','two','three','four'])

In [42]:
data

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [43]:
data2

         one  two  three  four
Daegu      0    1      2     3
 Sejong    4    5      6     7
Daejeon    8    9     10    11
Incheon   12   13     14    15

In [69]:
data2.ix[['Sejong','Incheon'],['two','four']]

c:\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

         two  four
Sejong     5     7
Incheon   13    15

In [78]:
data2.ix['Seongnam'] = [1,2,3,4]
data2

c:\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three  four
Daegu       0    1      2     3
Sejong      4    5      6     7
Daejeon     8    9     10    11
Incheon    12   13     14    15
Seongnam    1    2      3     4

In [79]:
data2.ix['Kwanju',['one','three']] = [11,22]
data2

c:\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

           one   two  three  four
Daegu      0.0   1.0    2.0   3.0
Sejong     4.0   5.0    6.0   7.0
Daejeon    8.0   9.0   10.0  11.0
Incheon   12.0  13.0   14.0  15.0
Seongnam   1.0   2.0    3.0   4.0
Kwanju    11.0   NaN   22.0   NaN

In [89]:
data3 = data2.reindex(columns=data2.columns, method='ffill' , copy=True)
data3

           one   two  three  four
Daegu      0.0   1.0    2.0   3.0
Sejong     4.0   5.0    6.0   7.0
Daejeon    8.0   9.0   10.0  11.0
Incheon   12.0  13.0   14.0  15.0
Seongnam   1.0   2.0    3.0   4.0
Kwanju    11.0   NaN   22.0   NaN

In [178]:
data2.fillna(method='ffilll')

ValueError: Invalid fill method. Expecting pad (ffill) or backfill (bfill). Got ffilll

In [111]:
obj = pd.Series(range(4), index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [117]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three','one'], columns=['d','a','b','c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [119]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [120]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [127]:
frame.sort_values(by=['d','a'])

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [128]:
obj = pd.Series([4,7,-3,2])

In [130]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [134]:
df = pd.DataFrame([[1.4, np.NaN], [7.1, -4.5], [np.NaN, np.nan], [0.75, -1.3]], index=['a','b','c','d'], columns=['one', 'tow'])
df

    one  tow
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [138]:
df.mean(skipna=True)

one    3.083333
tow   -2.900000
dtype: float64

In [140]:
df.describe()

            one       tow
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [145]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [147]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [149]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [151]:
mask = obj.isin(['b','c'])
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [156]:
data = pd.DataFrame({'Qu1': [1,3,4,3,4],
                    'Qu2': [2,3,1,2,3],
                    'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [158]:
pd.value_counts

In [159]:
rs = data.apply(pd.value_counts).fillna(0)
rs

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [162]:
from numpy import nan as nan
data = pd.Series([1,nan,3.5,nan,7])

In [164]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [166]:
from numpy import nan as na
data = pd.DataFrame([[1.,6.5, 3.], [1.,na, na], [na,na,na], [na,6.5,3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [167]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [169]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [172]:
data[4] = na
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [175]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [179]:
df = pd.DataFrame(np.random.randn(7,3))
df.ix[:4,1] = na; df.ix

c:\python36\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [182]:
data = pd.Series(np.random.randn(10), index=[['a','a','a','b,','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])
data

a   1    0.802724
    2   -0.671438
    3   -1.739274
b,  1    0.300669
b   2    0.863310
    3    0.320864
c   1   -0.097587
    2   -1.203702
d   2   -0.386574
    3    0.591730
dtype: float64

In [184]:
data.index

MultiIndex(levels=[['a', 'b', 'b,', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 2, 1, 1, 3, 3, 4, 4], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [186]:
data['b']

2    0.863310
3    0.320864
dtype: float64

In [190]:
#data['b':'c']
data.sort_index()['b':'c']

b   2    0.863310
    3    0.320864
b,  1    0.300669
c   1   -0.097587
    2   -1.203702
dtype: float64

In [191]:
data[:,2]

a   -0.671438
b    0.863310
c   -1.203702
d   -0.386574
dtype: float64

In [193]:
data.unstack()

           1         2         3
a   0.802724 -0.671438 -1.739274
b        NaN  0.863310  0.320864
b,  0.300669       NaN       NaN
c  -0.097587 -1.203702       NaN
d        NaN -0.386574  0.591730

In [195]:
data.unstack().stack()

a   1    0.802724
    2   -0.671438
    3   -1.739274
b   2    0.863310
    3    0.320864
b,  1    0.300669
c   1   -0.097587
    2   -1.203702
d   2   -0.386574
    3    0.591730
dtype: float64

In [197]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)), 
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['Ohi','Ohio', 'Colorado'],['Green','Red','Green']])
frame

      Ohi Ohio Colorado
    Green  Red    Green
a 1     0    1        2
  2     3    4        5
b 1     6    7        8
  2     9   10       11

In [200]:
frame.index.names = ['key1','key2']
frame

            Ohi Ohio Colorado
          Green  Red    Green
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [201]:
frame.columns.names = ['states','color']
frame

states      Ohi Ohio Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [210]:
frame['Ohio']

color      Red
key1 key2
a    1       1
     2       4
b    1       7
     2      10

In [212]:
frame.swaplevel('key1','key2')

states      Ohi Ohio Colorado
color     Green  Red    Green
key2 key1
1    a        0    1        2
2    a        3    4        5
1    b        6    7        8
2    b        9   10       11

In [224]:
frame.sort_values(by='key2')

states      Ohi Ohio Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
b    1        6    7        8
a    2        3    4        5
b    2        9   10       11

In [225]:
frame.sort_index(level=1)

states      Ohi Ohio Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
b    1        6    7        8
a    2        3    4        5
b    2        9   10       11

In [226]:
frame.sum(level='key2')

states   Ohi Ohio Colorado
color  Green  Red    Green
key2
1          6    8       10
2         12   14       16

In [227]:
frame.sum(level='color')

KeyError: 'Level color not found'

In [235]:

frame2 = frame.set_index(['Ohio','Colorado'])
frame2

NotImplementedError: > 1 ndim Categorical are not supported at this time

In [237]:

girl_height = pd.read_clipboard()

In [240]:
girl_height.head()

    earn     height     sex  ed  age   race
0  50000  74.424439    male  16   45  white
1  60000  65.537543  female  16   58  white
2  30000  63.629198  female  16   29  white
3  50000  63.108562  female  16   91  other
4  51000  63.402484  female  17   39  white

In [242]:
girl_height.describe()

                earn      height          ed         age
count     321.000000  321.000000  321.000000  321.000000
mean    23702.616822   66.757162   13.601246   41.249221
std     18663.329236    3.834660    2.210034   14.963504
min       200.000000   58.660317    8.000000   18.000000
25%     12000.000000   63.841265   12.000000   30.000000
50%     20000.000000   66.439008   13.000000   38.000000
75%     30000.000000   69.524561   16.000000   50.000000
max    170000.000000   76.800194   18.000000   91.000000

In [244]:
girl_height.set_index('race')

           earn     height     sex  ed  age
race
white     50000  74.424439    male  16   45
white     60000  65.537543  female  16   58
white     30000  63.629198  female  16   29
other     50000  63.108562  female  16   91
white     51000  63.402484  female  17   39
white      9000  64.399508  female  15   26
white     29000  61.656326  female  12   49
white     32000  72.698544    male  17   46
hispanic   2000  72.039467    male  15   21
white     27000  72.234933    male  12   26
white      6530  69.512146    male  16   65
white     30000  68.031608    male  11   34
white     12000  67.556934    male  12   27
white     12000  65.430587  female  12   51
white     22000  65.662855  female  16   35
white     17000  67.758769    male  12   58
white     40000  68.351843  female  14   29
white     44000  69.609572    male  13   44
black      7000  64.184566  female  12   55
black     53000  73.074609    male  13   35
white      5000  62.375527  female  13   51
white     14000  63.023930  female  14   21
white      5500  67.229904    male  14   22
white     40000  65.551108  female  12   41
white     34000  72.079645    male  12   45
black     10000  63.091130  female  12   35
white     27000  64.323549  female  16   60
white     50000  71.642853    male  16   38
white     41000  76.793095    male  16   33
white     15000  63.893914  female  14   25
...         ...        ...     ...  ..  ...
white     22000  61.765651  female  18   47
white     30000  61.616401  female  13   36
white     35000  70.554078    male  12   61
white     20000  74.081195    male  12   42
white     32000  65.472417  female  16   32
other      6000  63.365312  female  12   31
white     12000  66.850004  female  12   39
white     10000  63.266094  female  12   31
white      1000  64.745506  female  12   18
white     12000  63.542061  female  15   71
white     16000  64.923110  female  12   36
white     25000  63.242007  female  16   33
white     25000  69.524561  female  12   27
white     32000  67.978094    male  12   30
white     35000  66.548737    male  14   43
white      6000  64.588704  female  12   28
white     80000  68.766686    male  14   44
white     20000  68.083887  female  14   25
white      1000  65.815914  female  17   38
hispanic  28000  71.402376    male  13   38
hispanic  26000  63.763538    male  16   23
white     27000  73.525383    male  12   24
white     18000  61.979986  female  13   41
white      2000  65.210521  female  12   59
white     20000  69.375468    male  12   66
white      6000  66.086561  female  16   48
white     25000  66.525442    male  11   63
white     12000  73.172165    male  12   29
white     12000  76.184880    male  12   57
white     30000  69.525630    male  14   76

[321 rows x 5 columns]

### Read CSV

In [248]:
csvdata = pd.read_csv('people.csv',sep=';')

In [264]:
csvdata

    name  age        job
0  Jorge   30  Developer
1    Bob   32  Developer

In [288]:
csvdata['flag'] = csvdata['age'].max() == csvdata['age']
df = csvdata
df[df.age==df.age.max()]['name']

1    Bob
Name: name, dtype: object

In [290]:
df[df['age'] == df['age'].max()]

  name  age        job  flag
1  Bob   32  Developer  True

In [299]:
!type "ex4.csv"

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [305]:
pd.read_csv('ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [306]:
rs = pd.read_csv('csv/ex5.csv')
rs

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [308]:
pd.isnull(rs)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [310]:
sentinels = {'message': ['foo', 'NA'], 'someting':['two']}
sentinels

{'message': ['foo', 'NA'], 'someting': ['two']}

In [311]:
pd.read_csv('csv/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [312]:
chunker = pd.read_csv('csv/ex6.csv', chunksize=1000)
chunker

#### chunk로 잘라오기

In [322]:
tot = pd.Series()
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
#tot = tot.sort_values()
tot

Series([], dtype: float64)

###  CSV 로 저장(p.311)

In [324]:
data = pd.read_csv('csv/ex5.csv', na_values=sentinels)

In [325]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [ ]:
data.to_csv('output.csv')

In [ ]:
import sys
data.to_csv(sys.stdout, sep='|')

In [ ]:
data.to_csv(sys.out, na_rep ='NULL')

파일처리 할때 해결이 안되면 전체 처리 중에 실패할 가능성이 높아진다

In [327]:
data.to_pickle('frame_pickle')

In [328]:
pp = pd.read_pickle('frame_pickle')
pp

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### HDF5

In [329]:
!pip install hdf5

Collecting hdf5

  Could not find a version that satisfies the requirement hdf5 (from versions: )
No matching distribution found for hdf5

## DataFrame 합치기(Merge)

In [330]:
left = pd.DataFrame({'A': [1,2], 'B': [1,2]})
right = pd.DataFrame({'A':[4,5,6], 'B':[2,2,2]})
pd.merge(left, right, on='B', how='outer', validate='one_to_many')

   A_x  B  A_y
0    1  1  NaN
1    2  2  4.0
2    2  2  5.0
3    2  2  6.0

In [333]:
left

   A  B
0  1  1
1  2  2

In [334]:
right

   A  B
0  4  2
1  5  2
2  6  2

In [335]:
df1 = pd.DataFrame({'col1':[0,1], 'col_left':['a','b']})
df2 = pd.DataFrame({'col1':[1,2,2], 'col_right':[2,2,2]})
pd.merge(df1,df2,on='col1', how='outer', indicator=True)

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

In [336]:
pd.merge(df1,df2, on='col1', how='outer', indicator='indicator_column')

   col1 col_left  col_right indicator_column
0     0        a        NaN        left_only
1     1        b        2.0             both
2     2      NaN        2.0       right_only
3     2      NaN        2.0       right_only